In [1]:
# derste aldığım notlar 25

import numpy as np
import pandas as pd

In [2]:
sozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
          "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
          "Kalori" : [100,200,300,400]
          }

In [3]:
dataFrame1 = pd.DataFrame(sozluk1, index=[0,1,2,3])

In [4]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [5]:
sozluk2 = {"Isim" : ["Osman","Levent","Atlas","Fatma"],
          "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
          "Kalori" : [200,100,50,300]
          }

In [6]:
dataFrame2 = pd.DataFrame(sozluk2, index = [4,5,6,7])

In [7]:
sozluk3 = {"Isim" : ["Ayşe","Mahmut","Duygu","Nur"],
          "Spor" : ["Koşu","Yüzme","Badminton","Tenis"],
          "Kalori" : [300,400,500,250]
          }

In [8]:
dataFrame3 = pd.DataFrame(sozluk3, index = [8,9,10,11])

In [9]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [10]:
dataFrame3

      Isim       Spor  Kalori
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

# concatenation

In [11]:
toplananDataFrame = pd.concat([dataFrame1,dataFrame2,dataFrame3])  # 3 ayrı data frame i birleştirdik

In [12]:
toplananDataFrame

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

In [13]:
toplananDataFrame.count()

Isim      12
Spor      12
Kalori    12
dtype: int64

In [14]:
toplananDataFrame["Kalori"].mean()

258.3333333333333

In [15]:
groupOrnek = toplananDataFrame.groupby("Spor")

In [16]:
groupOrnek.count()

           Isim  Kalori
Spor
Badminton     1       1
Basketbol     2       2
Koşu          5       5
Tenis         1       1
Yüzme         3       3

In [17]:
groupOrnek.mean("Kalori")

               Kalori
Spor
Badminton  500.000000
Basketbol  350.000000
Koşu       190.000000
Tenis      250.000000
Yüzme      233.333333

# merge

In [18]:
mergeSozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"]}

In [19]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [20]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [21]:
mergeSozluk2 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Kalori" : [100,200,150,250]}

In [22]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [23]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atıl     250

In [24]:
pd.merge(mergeDataFrame1,mergeDataFrame2, on = "Isim") #  on = "Isim" komutu 2 data frame arasındaki ortak ilişkisi olanı yazıyoruz.

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     250

In [25]:
toplananMerge = pd.merge(mergeDataFrame1,mergeDataFrame2, on = "Isim") # bu kısım derste gösterilmedi ben yaptım

In [26]:
mergeGrouplama = toplananMerge.groupby("Spor")

In [27]:
mergeGrouplama.count()

           Isim  Kalori
Spor
Basketbol     1       1
Koşu          2       2
Yüzme         1       1

In [28]:
mergeGrouplama.mean("Kalori")

           Kalori
Spor
Basketbol   250.0
Koşu        125.0
Yüzme       200.0

In [29]:
maasSozluk = {"Isim" : ["Ahmet","Zeynep","Mehmet","Atıl"],
             "Departman" : ["Yazılım","Satis","Pazarlama","Yazılım"] ,
             "Maas" : [200,300,400,500]
             }

In [30]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [31]:
maasDataFrame

     Isim  Departman  Maas
0   Ahmet    Yazılım   200
1  Zeynep      Satis   300
2  Mehmet  Pazarlama   400
3    Atıl    Yazılım   500

In [32]:
maasDataFrame["Departman"].unique() # 2 adet yazılım departmanı olmasına rağmen sadece 1 ini getirdi

array(['Yazılım', 'Satis', 'Pazarlama'], dtype=object)

In [33]:
maasDataFrame["Departman"].nunique() # kaç tane özel depatman var

3

In [34]:
maasDataFrame["Departman"].value_counts() # hangi departmanda kaç kişi var

Departman
Yazılım      2
Satis        1
Pazarlama    1
Name: count, dtype: int64

In [35]:
def bruttenNete(maas):
    return maas * 0.66

In [36]:
maasDataFrame["Maas"].apply(bruttenNete) # fonksiyonu data frame e uyguladık

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [37]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [38]:
yeniBirVeri = {"Karakter Sınıfı" : ["South Park","South Park","Simpson","Simpson","Simpson"],
              "Karakter Ismi" : ["Cartman", "Kenny", "Homer", "Bart","Bart"],
              "Karakter Yas" : [9,10,50,20,10]
              }

In [39]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [40]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [41]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı" , "Karakter Ismi"] )

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                   15.0
                Homer                  50.0
South Park      Cartman                 9.0
                Kenny                  10.0

In [42]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı" , "Karakter Ismi"] , aggfunc = np.sum)

C:\Users\yalci\AppData\Local\Temp\ipykernel_10312\1017964114.py:1: FutureWarning: The provided callable <function sum at 0x000001A822E663A0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı" , "Karakter Ismi"] , aggfunc = np.sum)

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10